Revit 2024 API
PipeSettings.UseAnnotationScaleForSingleLineFittings Property
 Indicates whether use annotation scale for single line fittings or not.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
Visual Basic
Public Property UseAnnotationScaleForSingleLineFittings As Boolean
	Get
	Set
Visual C++
public:
property bool UseAnnotationScaleForSingleLineFittings {
	bool get ();
	void set (bool value);
}
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace